from pydantic import BaseModel

NOT_ADMIN = "Вы не являетесь администратором! 🚫 Доступ запрещен! 😠"
ANSWER_ADMIN = "Это меню администратора 👑, выбери из предложенного! 📋"
ANSWER_ADD_CATEGORY = 'Категория "%s" успешно добавлена! ✅'
ANSWER_CONFLICT_ADD_CATEGORY = 'Категория "%s" уже существует! ⚠️'


ANSWER_CANCEL = "Действие отменено. 😔"


NAME_ADD_CATEGORY = "Введите название категории! 🏷️📝"
UPDATE_CATEGORY = "Выберите категорию, которую хотите изменить"
DELETE_CATEGORY = "Выберите категорию, которую хотите удалить"

SUCCESS_UPDATE_CATEGORY = 'Категория изменена на "%s". ✅'
SUCCESS_DELETE_CATEGORY = "Категория успешно удалена!. ✅"
ERROR_DUPLICATE_NAME = "Такое имя уже существует. Попробуйте другое имя."
ERROR_EMPTY_NAME = "Имя не может быть пустым. Попробуйте снова."
VERIFY_NAME = "Текущее имя: %s \nВведите новое имя категории:"
VERIFY_DELETE_CAT = 'Действительно хотите удалить категорию "%s"? Подтвердите:'
VERIFY_UPDATE_CAT = 'Вы действительно хотите изменить на "%s"? Подтвердите:'


class Buttons(BaseModel):
    add_admin: str = "🚀  Добавить администратора!"
    add_category: str = "🔗 Добавить категорию!"
    update_category: str = "⏰ Редактировать категорию!"
    delete_category: str = "⏰ Удалить категорию!!"
    add_product: str = "➕ Добавить товар!"
    update_product: str = "⏰ Редактировать товар!"
    cancel: str = "❌ Отмена"
    confirm: str = "✅ Подтвердить"


buttons = Buttons()
